FKDD_COPY_DIFF_3_2026-02-14/Documents/ТехническоеДиагностирование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ТехническоеДиагностирование</Name>
			<Comment>Техническое диагностирование</Comment>
			<BasedOn>
				<xr:Item>Document.ДоговорПроведенияТехническогоОсмотра</xr:Item>
				<xr:Item>Document.ТехническоеДиагностирование</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СостоянияДокументов</xr:Item>
				<xr:Item>InformationRegister.ТехническоеДиагностирование</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Comment>Автор документа - пользователь, создавший документ.</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Юридическое лицо, от которого выписан документ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Comment>Подразделение компании в котором был выписан документ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Произвольный комментарий к документу</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Поставщик/комитент от которого мы получили товар</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорВзаиморасчетов</Name>
					<Comment>Договор по которому ведутся взаиморасчеты с контрагентом</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыВзаиморасчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставительКонтрагента</Name>
					<Comment>Представитель контрагента</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Comment>Документ, на основании которого введен данный</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ДоговорПроведенияТехническогоОсмотра</v8:Type>
						<v8:Type>cfg:DocumentRef.ТехническоеДиагностирование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Comment>Дата создания</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОперации</Name>
					<Comment>Дата операции</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Выполняемая документом операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автомобиль</Name>
					<Comment>Автомобиль</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пробег</Name>
					<Comment>Пробег автомобиля</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПриводаТормознойСистемы</Name>
					<Comment>Тип привода тормозной системы</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ТипПриводаТормознойСистемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаркаШин</Name>
					<Comment>Марка шин</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МассаБезНагрузки</Name>
					<Comment>Масса без нагрузки (кг)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешеннаяМаксимальнаяМасса</Name>
					<Comment>Разрешенная максимальная масса (кг)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипТоплива</Name>
					<Comment>Тип топлива</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыТоплива</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокОкончанияДействияТО</Name>
					<Comment>Срок окончания действия талона технического осмотра</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокПовторногоТО</Name>
					<Comment>Срок проведения повторного ТО</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IDДублирования</Name>
					<Comment>IDДублирования</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияТС</Name>
					<Comment>Категория ТС</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииТранспортныхСредств</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаркаТахографа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МодельТахографа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерийныйНомерТахографа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Требования</Name>
					<Comment>Требования к транспортному средству</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТребованиеКТранспортномуСредству</Name>
							<Comment>Требование к транспортному средству</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ТребованияКТранспортнымСредствам</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выполнено</Name>
							<Comment>Выполнено</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Comment>Значение параметра</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеМин</Name>
							<Comment>Значение минимальное</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеМакс</Name>
							<Comment>Значение максимальное</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыполненоНаПервичном</Name>
							<Comment>Выполнено на первичном диагностировании</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/InformationRegisters/ЖурналОтправкиВЕАИСТО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЖурналОтправкиВЕАИСТО</Name>
			<Comment>Журнал отправки в ЕАИСТО</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Comment>Статус</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыДокументаТО</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Действие</Name>
					<Comment>Действие</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ДействияЕАИСТО</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>НомерКаточкиНаСервере</Name>
					<Comment>Номер каточки на сервере</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IDКарточкиНаСервере</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Comment>Документ</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ТехническоеДиагностирование</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/Enums/СтатусыДокументаТО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыДокументаТО</Name>
			<Comment>Статусы документа ТО</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Отправить</Name>
					<Comment>Отправить</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отправлено</Name>
					<Comment>Отправлено</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеОтправлять</Name>
					<Comment>Не отправлять</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/Enums/ДействияЕАИСТО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ДействияЕАИСТО</Name>
			<Comment>Действия ЕАИСТО</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Добавить</Name>
					<Comment>Добавить</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Изменить</Name>
					<Comment>Изменить</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Удалить</Name>
					<Comment>Удалить</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/Catalogs/ТребованияКТранспортнымСредствам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ТребованияКТранспортнымСредствам</Name>
			<Comment>Требования к транспортным средствам</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Comment>Номер требования</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>Полное наименование, например, для печати</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Comment>Описание требования</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеМин</Name>
					<Comment>Значение минимальное</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеМакс</Name>
					<Comment>Значение максимальное</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДиапазонЗначений</Name>
					<Comment>Диапазон значений требования</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КатегорияТранспортногоСредства</Name>
							<Comment>Категория транспортного средства</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.КатегорииТранспортныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеМин</Name>
							<Comment>Значение минимальное</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеМакс</Name>
							<Comment>Значение максимальное</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/Documents/ТехническоеДиагностирование/Ext/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ ОБЪЕКТА

Перем Права Экспорт;				// Переменная объекта - ссылка на коллекцию прав, настроек и переменных окружения
Перем РезультатОбработки Экспорт;	// Переменная для накопления результатов проведения по модулям наборов записей
Перем ИмяРеквизитаКода Экспорт;     // Кэш права "РежимВыводаКодаВДокументах". Служит для настройки вывода кода/артикула в ТЧ
Перем ОбработкаЗначенияСвойствОбъектов Экспорт; // Переменная для хранения значения свойств основания/объекта копирования

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОПОЛНИТЕЛЬНЫХ МЕТОДОВ ОБЪЕКТА

// Возвращает структуру обязательных / уникальных реквизитов документа
// Возвращаемая структура содержит строковые идентификаторы реквизитов или вложенные структуры для табличных частей
// Для реквизита значение структуры содержит число 1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный
Функция ПолучитьОбязательныеРеквизиты() Экспорт
	Дубликат = (ХозОперация = Справочники.ХозОперации.ТехническоеДиагностированиеДубликат);
	ОбязательныеРеквизиты=Новый Структура();
	// Обязательные поля таблицы товаров
	Если НЕ Дубликат Тогда
		ОбязательныеТребования=Новый Структура();
		ОбязательныеТребования.Вставить("ТребованиеКТранспортномуСредству",3);
		
		// Обязательные реквизиты документа
		ОбязательныеРеквизиты.Вставить("ДокументОснование",1);
		ОбязательныеРеквизиты.Вставить("Организация",1);
		ОбязательныеРеквизиты.Вставить("ПодразделениеКомпании",1);
		ОбязательныеРеквизиты.Вставить("Автор",1);
		ОбязательныеРеквизиты.Вставить("ХозОперация",1);
		ОбязательныеРеквизиты.Вставить("Контрагент",1);
		ОбязательныеРеквизиты.Вставить("ДоговорВзаиморасчетов",1);
		Если Контрагент.ФормаСобственности=Перечисления.ФормыСобственности.ЮридическоеЛицо Тогда
			ОбязательныеРеквизиты.Вставить("ПредставительКонтрагента",1);
		КонецЕсли; 
		ОбязательныеРеквизиты.Вставить("Автомобиль",1);
		ОбязательныеРеквизиты.Вставить("ТипПриводаТормознойСистемы",1);
		ОбязательныеРеквизиты.Вставить("МаркаШин",1);
		ОбязательныеРеквизиты.Вставить("МассаБезНагрузки",1);
		ОбязательныеРеквизиты.Вставить("РазрешеннаяМаксимальнаяМасса",1);
		ОбязательныеРеквизиты.Вставить("Требования",ОбязательныеТребования);
		Если ПроверкаПрохожденияТО() Тогда
			ОбязательныеРеквизиты.Вставить("СрокОкончанияДействияТО",1);
		Иначе
			Если ХозОперация <> Справочники.ХозОперации.ТехническоеДиагностированиеПовторное Тогда
				ОбязательныеРеквизиты.Вставить("СрокПовторногоТО",1);
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;
		
	Возврат ОбязательныеРеквизиты;
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Проверяет корректность заполнения объекта.
// может управляться булевыми флагами выполняемых проверок Заполнение, Уникальность
// (могут быть и другие необязательные)
// Обычно выполняется универсальным обработчиком, но могут быть добавлены доп. проверки
//
// Параметры:
//  Ошибки       - строка, в случае некорректного заполнения содержит описанием возникших ошибок, 
//  ДопРеквизиты - структура, на вход может быть передана структура с дополнительными реквизитами для проверки,
//  Заполнение   - булево, флаг проверки, 
//  Уникальность - булево, флаг проверки.
//
// Возвращаемое значение:
//  Булево - Возвращает Истина если все заполнено корректно и Ложь иначе.
// 
Функция ПроверитьКорректность(Ошибки="", ДопРеквизиты=Неопределено, Заполнение=Истина, Уникальность=Истина) Экспорт
	// Здесь могут быть определены дополнительные к стандартным обязательным реквизитам условия проверки
	Результат = дкПроверитьКорректность(ЭтотОбъект, Ошибки, ДопРеквизиты, Заполнение, Уникальность, Истина);
	
	Если ХозОперация <> Справочники.ХозОперации.ТехническоеДиагностированиеДубликат Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТехническоеДиагностирование.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ТехническоеДиагностирование КАК ТехническоеДиагностирование
		|ГДЕ
		|	ТехническоеДиагностирование.ДокументОснование = &ДокументОснование
		|	И ТехническоеДиагностирование.Ссылка <> &Ссылка";
		Запрос.УстановитьПараметр("ДокументОснование",ДокументОснование);
		Запрос.УстановитьПараметр("Ссылка",Ссылка);
		Выборка=Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			дкДобавитьОшибку(Ошибки,"На основании <"+ДокументОснование+"> уже есть введенный документ <"+Выборка.Ссылка+">.");
			Результат=Ложь;
		КонецЕсли;
	КонецЕсли;
	Если Требования.Количество() = 0 Тогда
		дкДобавитьОшибку(Ошибки,"В документе не указанно ни одного требования для ТС.");
		Результат=Ложь;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции // ПроверитьКорректность()

// Функция проверяет, допустимо ли изменение объекта
//
// Параметры:
//  БлокироватьРеквизиты - структура, структура блокируемых на изменение реквизитов.
//
// Возвращаемое значение:
// Булево - Возвращает Истина, если изменения возможны, ложь иначе
//          Если изменения доступны частично, возвращает ложь и структуру блокируемых на изменение реквизитов.
//
Функция ДоступностьИзменения(БлокироватьРеквизиты=Неопределено) Экспорт
	// Здесь может быть прописано определение наличия ссылок, блокирующих изменение объекта
	Возврат Истина;
КонецФункции // ДоступностьИзменения()

// Возвращает список возможных хозяйственных операций документа
// Возвращаемое значение: 
//  СписокЗначений. 
//  Строка списка: Значение - имя предопределенного элемента; 
//				   Представление - красивое его представление
// 				   "Помеченная" строка - ХО по умолчанию.
Функция ПолучитьСписокХозОпераций() Экспорт
	СписокХозОпераций = Новый СписокЗначений;
	СписокХозОпераций.Добавить("ТехническоеДиагностированиеПервичное","Техническое диагностирование",Истина);
	СписокХозОпераций.Добавить("ТехническоеДиагностированиеПовторное","Повторное техническое диагностирование",Ложь);
	СписокХозОпераций.Добавить("ТехническоеДиагностированиеДубликат", "Дубликат технического диагностирования", Ложь);
	Возврат СписокХозОпераций;
КонецФункции // ПолучитьСписокХозОпераций()

// Обработка изменения реквизитов документа
// Параметры
//  Имя			– Строка – Имя реквизита документа с полным путем (например Товары.Номенклатура).
//  ЭтаФорма	– Форма	 – Ссылка на форму документа. Если значение неопределено,
//                         производится программная обработка реквизитов.
//  ТекСтрока	– СтрокаТабличнойЧасти – Ссылка на строку табличной части документа, реквизит которой обрабатывается.
//										 Имеет смысл только для табличных частей документов.
//  ДопПараметры– Структура			– Структура, содержащая дополнительные параметры обработки реквизита.
// Возвращаемое значение:
//   Булево   – Результат выполнения обработки.
Функция ОбработкаРеквизита(Имя,ТекСтрока=Неопределено,ЭтаФорма=Неопределено,ДопПараметры=Неопределено) Экспорт
	Рез=Истина;

	// ОБРАБОТКА РЕКВИЗИТОВ ДОКУМЕНТА
	Если Имя="Дата" Тогда
		Рез=дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
		Если НЕ обЗначениеНеЗаполнено(Автомобиль) Тогда
			Пробег=Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Автомобиль,Перечисления.ДополнительнаяИнформацияАвтомобилей.Пробег,Дата);
		КонецЕсли;
		Рез=ОбработкаРеквизита("РасчитатьСрокОкончанияДействияТО",,ЭтаФорма,ДопПараметры) И Рез;
		Рез=ОбработкаРеквизита("РасчитатьСрокПовторногоТО",,ЭтаФорма,ДопПараметры) И Рез;
		Возврат Рез;
	ИначеЕсли Имя = "РасчитатьСрокОкончанияДействияТО" Тогда
		ПериодСледующегоТО = ПолучитьПериодСледующегоТО(Автомобиль);
		Если ПериодСледующегоТО > 0 Тогда
			СрокОкончанияДействияТО = ДобавитьМесяц(Дата,ПериодСледующегоТО);	
		Иначе
			СрокОкончанияДействияТО = Неопределено;
		КонецЕсли;
		Возврат Истина;
	ИначеЕсли Имя = "РасчитатьСрокПовторногоТО" Тогда
		Если ХозОперация = Справочники.ХозОперации.ТехническоеДиагностированиеПервичное Тогда
			СрокПовторногоТО = Дата+20*24*60*60;
		Иначе
			СрокПовторногоТО = Неопределено;
		КонецЕсли;
		Возврат Истина;
	ИначеЕсли Имя="ДокументОснование" Тогда
		ЭтотОбъект.Заполнить(ДокументОснование);
		Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ТехническоеДиагностирование") Тогда
			Если ДокументОснование.ХозОперация=Справочники.ХозОперации.ТехническоеДиагностированиеПовторное Тогда
				#Если Клиент Тогда
				Предупреждение("На основании договора проведения технического осмотра может быть проведено только одно повторное техническое диагностирование!",10);
				#КонецЕсли
				ДокументОснование=Неопределено;
			Иначе
				ХозОперация = Справочники.ХозОперации.ТехническоеДиагностированиеПовторное;
			КонецЕсли; 
			Если ЭтаФорма<>Неопределено Тогда
				ЭтаФорма.ДействияФормыОперация(ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.Операция.Кнопки.ТехническоеДиагностированиеПовторное);
			КонецЕсли; 
		ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ДоговорПроведенияТехническогоОсмотра") Тогда
			ХозОперация = Справочники.ХозОперации.ТехническоеДиагностированиеПервичное;
			Если ЭтаФорма<>Неопределено Тогда
				ЭтаФорма.ДействияФормыОперация(ЭтаФорма.ЭлементыФормы.ДействияФормы.Кнопки.Операция.Кнопки.ТехническоеДиагностированиеПервичное);
			КонецЕсли; 
		КонецЕсли;
		#Если Клиент Тогда
		Если ЭтаФорма<>Неопределено Тогда
			Попытка
				ЭтаФорма.СоздатьЗакладкиПанелиТребований();
			Исключение
			КонецПопытки; 
			Попытка
				ЭтаФорма.УправлениеДиалогом();
			Исключение
			    Попытка
					ЭтаФорма.ВладелецФормы.УправлениеДиалогом();
				Исключение
				КонецПопытки; 
			КонецПопытки; 
		КонецЕсли; 
		#КонецЕсли
		Возврат Рез;
		
	ИначеЕсли Имя = "Контрагент" Тогда
		Рез = дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
		
		Если ЗначениеЗаполнено(ПредставительКонтрагента) Тогда
			Если НЕ РаботаСКонтактнымиЛицами.ЭтоВедущий(ПредставительКонтрагента, Контрагент) Тогда
				ПредставительКонтрагента = Справочники.Контрагенты.ПустаяСсылка();
				Рез = ОбработкаРеквизита("ПредставительКонтрагента",ТекСтрока,ЭтаФорма,ДопПараметры) И Рез;
			КонецЕсли; 
		КонецЕсли; 
		Возврат Рез;
		
	ИначеЕсли Имя = "ПредставительКонтрагента" Тогда
		
		Если ЗначениеЗаполнено(ПредставительКонтрагента) И НЕ РаботаСКонтактнымиЛицами.ЭтоВедущий(ПредставительКонтрагента, Контрагент) Тогда
			Контрагент = РаботаСКонтактнымиЛицами.ПолучитьВедущегоКонтрагента(ПредставительКонтрагента);
			Рез = ОбработкаРеквизита("Контрагент",ТекСтрока,ЭтаФорма,ДопПараметры);
		КонецЕсли;
		
		Возврат Рез;
		
	ИначеЕсли Имя="ДоговорВзаиморасчетов" Тогда
		Рез=дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
		#Если Клиент Тогда
		Если ЭтаФорма<>Неопределено Тогда
			Попытка
				ЭтаФорма.УправлениеДиалогом();
			Исключение
			    Попытка
					ЭтаФорма.ВладелецФормы.УправлениеДиалогом();
				Исключение
				КонецПопытки; 
			КонецПопытки; 
		КонецЕсли; 
		#КонецЕсли
		Возврат Рез;
		
	ИначеЕсли Имя="Автомобиль" Тогда
		Если НЕ обЗначениеНеЗаполнено(Автомобиль) Тогда
			Пробег=Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Автомобиль,Перечисления.ДополнительнаяИнформацияАвтомобилей.Пробег,Дата);
			Если обЗначениеНеЗаполнено(ТипПриводаТормознойСистемы) Тогда
				ТипПриводаТормознойСистемы=обПолучитьЗначениеСвойства(Автомобиль.Модель,ПланыВидовХарактеристик.СвойстваОбъектов.ТипПриводаТормознойСистемы);
			КонецЕсли;
			Если обЗначениеНеЗаполнено(МассаБезНагрузки) Тогда
				МассаБезНагрузки=обПолучитьЗначениеСвойства(Автомобиль.Модель,ПланыВидовХарактеристик.СвойстваОбъектов.МассаБезНагрузки);
			КонецЕсли;
			Если обЗначениеНеЗаполнено(РазрешеннаяМаксимальнаяМасса) Тогда
				РазрешеннаяМаксимальнаяМасса=обПолучитьЗначениеСвойства(Автомобиль.Модель,ПланыВидовХарактеристик.СвойстваОбъектов.РазрешеннаяМаксимальнаяМасса);
			КонецЕсли;
			Если обЗначениеНеЗаполнено(ТипТоплива) Тогда
				ТипТоплива = обПолучитьЗначениеСвойства(Автомобиль.ВариантКомплектации, ПланыВидовХарактеристик.СвойстваОбъектов.ТипТоплива);
				Если обЗначениеНеЗаполнено(ТипТоплива) Тогда
					ТипТоплива = обПолучитьЗначениеСвойства(Автомобиль.Модель,ПланыВидовХарактеристик.СвойстваОбъектов.ТипТоплива);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		#Если Клиент Тогда
		Если ЭтаФорма<>Неопределено Тогда
			Попытка
				ЭтаФорма.УправлениеДиалогом();
			Исключение
			    Попытка
					ЭтаФорма.ВладелецФормы.УправлениеДиалогом();
				Исключение
				КонецПопытки; 
			КонецПопытки; 
		КонецЕсли; 
		#КонецЕсли
		ТребованияТЗ=Требования.Выгрузить();
		Рез=зфЗащищенныеФункцииСервер.ТехническоеДиагностированиеОбработкаРеквизитаАвтомобиль(ТребованияТЗ,Автомобиль);
		Требования.Загрузить(ТребованияТЗ);
		ФормаДокумента=ЭтотОбъект.ПолучитьФорму();
		Если ФормаДокумента.Открыта() Тогда
			ФормаДокумента.СоздатьЗакладкиПанелиТребований();
		КонецЕсли; 
		Возврат Рез;

	ИначеЕсли Имя="Требования.Значение" Тогда
		Если (НЕ обЗначениеНеЗаполнено(ТекСтрока.ЗначениеМин)) ИЛИ
			 (НЕ обЗначениеНеЗаполнено(ТекСтрока.ЗначениеМакс)) Тогда
			 
			//если задан диапазон значений - выполним проверку на соответствие диапазону
			Если обЗначениеНеЗаполнено(ТекСтрока.ЗначениеМин) И НЕ обЗначениеНеЗаполнено(ТекСтрока.ЗначениеМакс) Тогда
				//ограничен верхний диапазон
				Если ТекСтрока.Значение >= ТекСтрока.ЗначениеМин И  
					ТекСтрока.Значение <= ТекСтрока.ЗначениеМакс Тогда
					ТекСтрока.Выполнено = Истина;
				Иначе
					ТекСтрока.Выполнено = Ложь;
				КонецЕсли;
			ИначеЕсли НЕ обЗначениеНеЗаполнено(ТекСтрока.ЗначениеМин) И обЗначениеНеЗаполнено(ТекСтрока.ЗначениеМакс) Тогда
				//ограничен нижний диапазон
				Если ТекСтрока.Значение >= ТекСтрока.ЗначениеМин Тогда
					ТекСтрока.Выполнено = Истина;
				Иначе
					ТекСтрока.Выполнено = Ложь;
				КонецЕсли;
			Иначе
				//задан верхний и нижний диапазон
				Если ТекСтрока.Значение >= ТекСтрока.ЗначениеМин И  
					ТекСтрока.Значение <= ТекСтрока.ЗначениеМакс Тогда
					ТекСтрока.Выполнено = Истина;
				Иначе
					ТекСтрока.Выполнено = Ложь;
				КонецЕсли;
			КонецЕсли;
			  
		КонецЕсли;
		Возврат Рез;
		
	Иначе Возврат дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
	КонецЕсли;
	
	Возврат Рез;
КонецФункции // ОбработкаРеквизита()

// заполнение свойств из документа основания
Процедура ЗаполнитьСвойстваНаОсновании(Основание) Экспорт
	//зарезервировано для описания заполнения свойств из свойств основания
КонецПроцедуры

// возвращает количество месяцев до следующего ТО в зависимости от категории ТС
// в соответствии  с законом "О техническом осмотре транспортных средств"  от 1 июля 2011 года N 170-ФЗ
// Статья 15. Периодичность проведения технического осмотра
Функция ПолучитьПериодСледующегоТО(Автомобиль) Экспорт
	
	Если обЗначениеНеЗаполнено(Автомобиль) Тогда
		Возврат 0;
	КонецЕсли;
	
	Если обЗначениеНеЗаполнено(Автомобиль.Модель) Тогда
		Возврат 0;
	КонецЕсли;
	
	КатегорияТС = Автомобиль.Модель.КатегорияТС;
	Если обЗначениеНеЗаполнено(КатегорияТС) Тогда
		Возврат 0;
	КонецЕсли;	
	
	ГодВыпуска = Автомобиль.ГодВыпуска;	
	Если ГодВыпуска <> Неопределено Тогда
		РазностьДат = Макс(Год(ДобавитьМесяц(Дата,12)) - Год(ГодВыпуска),    0);
	КонецЕсли;
	
	Если 	КатегорияТС = Справочники.КатегорииТранспортныхСредств.МопедыДвухколесные
		ИЛИ КатегорияТС = Справочники.КатегорииТранспортныхСредств.МопедыТрехколесные
		ИЛИ КатегорияТС = Справочники.КатегорииТранспортныхСредств.КвадроциклыДо350
		ИЛИ КатегорияТС = Справочники.КатегорииТранспортныхСредств.КвадроциклыДо400
		ИЛИ КатегорияТС = Справочники.КатегорииТранспортныхСредств.МотоциклыДвухколесные
		ИЛИ КатегорияТС = Справочники.КатегорииТранспортныхСредств.МотоциклыТрехколесныеАссиметричные
		ИЛИ КатегорияТС = Справочники.КатегорииТранспортныхСредств.МотоциклыТрехколесныеСиметричные	
		ИЛИ КатегорияТС = Справочники.КатегорииТранспортныхСредств.АвтомобилиЛегковые
		ИЛИ КатегорияТС = Справочники.КатегорииТранспортныхСредств.ГрузовикиДо3500
		ИЛИ КатегорияТС = Справочники.КатегорииТранспортныхСредств.Прицепы
		ИЛИ КатегорияТС = Справочники.КатегорииТранспортныхСредств.ПрицепыДо10000 Тогда
		Если РазностьДат = 1 Тогда
			//Год выпуска 2012, текущее ТО в 2012 - следующее ТО в 2015.
			Возврат 36;
		ИначеЕсли РазностьДат < 7 Тогда
			//Год выпуска 2011 и ранее, текущее ТО в 2012 - следующее ТО в 2014.
			Возврат 24;
		Иначе
			//Год выпуска 2006 и ранее, текущее ТО в 2012 - следующее ТО в 2013.
			Возврат 12;
		КонецЕсли;
	ИначеЕсли КатегорияТС = Справочники.КатегорииТранспортныхСредств.Автобусы
		ИЛИ КатегорияТС = Справочники.КатегорииТранспортныхСредств.АвтобусыДо5000 Тогда
		Возврат 6;	
	ИначеЕсли КатегорияТС = Справочники.КатегорииТранспортныхСредств.Грузовики
		ИЛИ КатегорияТС = Справочники.КатегорииТранспортныхСредств.ГрузовикиДо12000 Тогда
		Возврат 12;	
	ИначеЕсли КатегорияТС = Справочники.КатегорииТранспортныхСредств.ПрицепыДо3500
		ИЛИ КатегорияТС = Справочники.КатегорииТранспортныхСредств.ПрицепыДо750 Тогда
		Возврат 0;	
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

// возвращает Истина, когда ТО пройден (все пункты в ТЧ "требования" выполнены)
//
Функция ПроверкаПрохожденияТО() Экспорт
	Возврат (Требования.Найти(Ложь,"Выполнено")=Неопределено);
КонецФункции

Процедура ДобавитьВСписокОтправкиВЕАИСТО(ДокументОбъект, Статус = Неопределено, Действие = Неопределено) Экспорт
	Если Статус = Неопределено ИЛИ ТипЗнч(Статус) <> Тип("ПеречислениеСсылка.СтатусыДокументаТО") Тогда
		Статус = Перечисления.СтатусыДокументаТО.Отправить;
	КонецЕсли;
	
	Если Действие = Неопределено ИЛИ ТипЗнч(Действие) <> Тип("ПеречислениеСсылка.ДействияЕАИСТО") Тогда
		Действие = Перечисления.ДействияЕАИСТО.Добавить;
	КонецЕсли;
	
	НаборЗаписейРегистра = РегистрыСведений.ЖурналОтправкиВЕАИСТО.СоздатьНаборЗаписей();
	
	// установим отборы по документу
	ОтборДок = НаборЗаписейРегистра.Отбор.Найти("Документ");
	Если ОтборДок = Неопределено Тогда
		ОтборДок = НаборЗаписейРегистра.Отбор.Добавить("Документ","Документ");
	КонецЕсли;
	
	ОтборДок.ВидСравнения  = ВидСравнения.Равно;
	ОтборДок.Значение      = ДокументОбъект.Ссылка;
	ОтборДок.Использование = Истина;
	
	НаборЗаписейРегистра.Прочитать();
	
	Если НаборЗаписейРегистра.Количество() > 0 Тогда
		СтрокаНабора = НаборЗаписейРегистра[0];
	Иначе
		СтрокаНабора = НаборЗаписейРегистра.Добавить();
	КонецЕсли;
	
	СтрокаНабора.Документ = ДокументОбъект.Ссылка;
	СтрокаНабора.Статус   = Статус;
	Если Действие = Перечисления.ДействияЕАИСТО.Добавить И НЕ обЗначениеНеЗаполнено(СтрокаНабора.IDКарточкиНаСервере) Тогда
		Действие = Перечисления.ДействияЕАИСТО.Изменить;
	КонецЕсли;
	СтрокаНабора.Действие = Действие;
	
	Попытка
		НаборЗаписейРегистра.Записать();
	Исключение
		Сообщить("Не удалось записать данные об отправке по причине: " + Символы.ПС + ОписаниеОшибки() + ".");
	КонецПопытки;
КонецПроцедуры

#Если Клиент Тогда
	
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ПЕЧАТИ ДОКУМЕНТА

Функция ПечатьДиагностическаяКарта(ТабДокумент) Экспорт
	
	Если ЭтотОбъект.Модифицированность() Тогда
		Ответ = Вопрос("Перед печатью документ необходимо записать. Продолжить?",РежимДиалогаВопрос.ДаНет);
		Если Ответ = КодВозвратаДиалога.Да Тогда
			ЭтотОбъект.Записать();
		Иначе
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	Макет = ПолучитьМакет("ДиагностическаяКарта");
	ОбластьМакета = Макет.ПолучитьОбласть("ЛицеваяСторона");
	
	Если ЗначениеЗаполнено(Номер) Тогда
		НомерСтрокой = Строка(Номер);
		Для Сч = 1 По СтрДлина(НомерСтрокой) Цикл
			ОбластьМакета.Параметры["Р"+Сч] = Сред(НомерСтрокой,Сч,1);
		КонецЦикла;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СрокОкончанияДействияТО) Тогда
		ДатаСтрокой = Формат(СрокОкончанияДействияТО,"ДФ=ddMMyyyy");
		Для Сч = 1 По СтрДлина(ДатаСтрокой) Цикл
			ОбластьМакета.Параметры["С"+Сч] = Сред(ДатаСтрокой,Сч,1);
		КонецЦикла;
	КонецЕсли;
	
	АттестатТО = спПолучитьПодтверждающийДокументОбъектаПоВиду(ЭтотОбъект.ПодразделениеКомпании,Перечисления.ВидыДокументов.АттестатТО);
	НомерВреестре = "";
	Если (ЗначениеЗаполнено(АттестатТО)) И (ЗначениеЗаполнено(АттестатТО.НомерВРеестреОператоровТО))  Тогда
		НомерВреестре =  " №" + АттестатТО.НомерВРеестреОператоровТО;
	КонецЕсли;
	ОбластьМакета.Параметры.Оператор = ?(ЗначениеЗаполнено(ЭтотОбъект.Организация.КодОператора), ЭтотОбъект.Организация.КодОператора, "") + " " + Строка(ЭтотОбъект.Организация.НаименованиеПолное) + " ("+Строка(ЭтотОбъект.Организация.Наименование)+")"+НомерВреестре;
	ОбластьМакета.Параметры.Пункт = киПолучитьПредставлениеКИ(ЭтотОбъект.ПодразделениеКомпании, Справочники.ВидыКонтактнойИнформации.АдресФактический) + ", " + киПолучитьПредставлениеКИ(ЭтотОбъект.ПодразделениеКомпании, Перечисления.ТипыКонтактнойИнформации.Телефон);
	
	ОбластьМакета.Параметры.Первичная = "x";
	ОбластьМакета.Параметры.Повторная = "";
	
	Если ЗначениеЗаполнено(КатегорияТС) Тогда
		ОбластьМакета.Параметры.КатегорияТС = ?(ТипЗнч(КатегорияТС) = Тип("Строка"),КатегорияТС,КатегорияТС.КодПоКлассификатору);
	КонецЕсли;
	
	Если ТипЗнч(Автомобиль) = Тип("СправочникСсылка.Автомобили") И ЗначениеЗаполнено(Автомобиль.Модель) Тогда
		ОбластьМакета.Параметры.Модель = ""+ ?(Автомобиль.Модель.Родитель.Пустая(),"", Строка(Автомобиль.Модель.Родитель) + " " ) + Строка(Автомобиль.Модель);
		ОбластьМакета.Параметры.ГосНомер = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер,Дата);
		ОбластьМакета.Параметры.VIN = Автомобиль.VIN;
		
		ОбластьМакета.Параметры.НомерРамы = Автомобиль.НомерШасси;
		ОбластьМакета.Параметры.НомерКузова = Автомобиль.НомерКузова;
		//ПТС = спПолучитьПодтверждающийДокументОбъектаПоВиду(Автомобиль,Перечисления.ВидыДокументов.ПТС);
		ПТС = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.ТехПаспорт);
		Если ЗначениеЗаполнено(ПТС) Тогда
			ОбластьМакета.Параметры.ПТС ="";
			ОбластьМакета.Параметры.ПТС = Строка(ПТС.ВидПодтверждающегоДокумента) + " " + ПТС.Серия + " № "+ ПТС.Номер + " выдан " + ПТС.КемВыдан + " " + Формат(ПТС.ДатаВыдачи,"ДФ='dd MMMM yyyy'") + "г. ";
		КонецЕсли;
		Если ЗначениеЗаполнено(МодельТахографа) Или 
			ЗначениеЗаполнено(МаркаТахографа) Или ЗначениеЗаполнено(СерийныйНомерТахографа) Тогда
			ОбластьМакета.Параметры.Тахограф = СокрЛП(МаркаТахографа) + ", " + СокрЛП(МодельТахографа) + ", " + СокрЛП(СерийныйНомерТахографа);
		КонецЕсли;

		//ОбластьМакета.Параметры.ПТС = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.ТехПаспорт);
		ОбластьМакета.Параметры.ГодВыпуска = Формат(Автомобиль.ГодВыпуска,"ДФ=yyyy");
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ТехническоеДиагностированиеТребования.Ссылка,
	|	ТехническоеДиагностированиеТребования.ТребованиеКТранспортномуСредству,
	|	ТехническоеДиагностированиеТребования.Выполнено,
	|	ТехническоеДиагностированиеТребования.Значение,
	|	ТехническоеДиагностированиеТребования.ЗначениеМин,
	|	ТехническоеДиагностированиеТребования.ЗначениеМакс
	|ПОМЕСТИТЬ ТЧ
	|ИЗ
	|	Документ.ТехническоеДиагностирование.Требования КАК ТехническоеДиагностированиеТребования
	|ГДЕ
	|	ТехническоеДиагностированиеТребования.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТребованияКТранспортнымСредствам.Номер,
	|	ТребованияКТранспортнымСредствам.Ссылка,
	|	ВЫБОР
	|		КОГДА ТЧ.Выполнено ЕСТЬ NULL 
	|			ТОГДА ""-""
	|		КОГДА ТЧ.Выполнено
	|			ТОГДА "" ""
	|		ИНАЧЕ ""х""
	|	КОНЕЦ КАК Значение
	|ИЗ
	|	Справочник.ТребованияКТранспортнымСредствам КАК ТребованияКТранспортнымСредствам
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТЧ КАК ТЧ
	|		ПО (ТЧ.ТребованиеКТранспортномуСредству = ТребованияКТранспортнымСредствам.Ссылка)
	|ГДЕ
	|	НЕ ТребованияКТранспортнымСредствам.ЭтоГруппа
	|	И ТребованияКТранспортнымСредствам.Номер МЕЖДУ 0 И 70
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЧ.ЗначениеМин КАК НГраница,
	|	ТЧ.ЗначениеМакс КАК ВГраница,
	|	ТЧ.Значение,
	|	ВЫРАЗИТЬ(ТЧ.ТребованиеКТранспортномуСредству.НаименованиеПолное КАК СТРОКА(1000)) КАК Требование,
	|	ТЧ.ТребованиеКТранспортномуСредству.Номер КАК Номер
	|ИЗ
	|	ТЧ КАК ТЧ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТребованияКТранспортнымСредствам.ДиапазонЗначений КАК ТребованияКТранспортнымСредствамДиапазонЗначений
	|		ПО ТЧ.ТребованиеКТранспортномуСредству = ТребованияКТранспортнымСредствамДиапазонЗначений.Ссылка
	|			И (ТребованияКТранспортнымСредствамДиапазонЗначений.КатегорияТранспортногоСредства"+?(ТипЗнч(КатегорияТС) = Тип("Строка"),".Наименование","")+" = &КатегорияТС)
	|ГДЕ
	|	НЕ ТЧ.Выполнено
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЧ.Значение,
	|	ВЫРАЗИТЬ(ТЧ.ТребованиеКТранспортномуСредству.НаименованиеПолное КАК СТРОКА(1000)) КАК Требование,
	|	ТЧ.ТребованиеКТранспортномуСредству.Номер КАК Номер,
	|	ЕСТЬNULL(ТребованияКТранспортнымСредствам.Наименование, """") КАК Деталь
	|ИЗ
	|	ТЧ КАК ТЧ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТребованияКТранспортнымСредствам КАК ТребованияКТранспортнымСредствам
	|		ПО ТЧ.ТребованиеКТранспортномуСредству.Родитель = ТребованияКТранспортнымСредствам.Ссылка
	|ГДЕ
	|	НЕ ТЧ.Выполнено
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номер";
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Запрос.УстановитьПараметр("КатегорияТС",КатегорияТС);
	
	Пакет = Запрос.ВыполнитьПакет();
	
	Выборка = Пакет[1].Выбрать();
	Пока Выборка.Следующий() Цикл
		Попытка
			ОбластьМакета.Параметры["Показатель"+Выборка.Номер] = Выборка.Значение;	
		Исключение
		КонецПопытки
	КонецЦикла;
	
	ТабДокумент.Вывести(ОбластьМакета);
	ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	
	ОбластьМакета = Макет.ПолучитьОбласть("ОборотнаяШапка");
	ТабДокумент.Вывести(ОбластьМакета);
	
	Выборка = Пакет[2].Выбрать();
	КоличествоСтрок = Выборка.Количество();
	ПунктыПовторно = "";
	Флаг = Ложь;
	ОбластьМакета = Макет.ПолучитьОбласть("ОборотнаяСтрокаПараметров");
	Если Выборка.Количество() > 20 Тогда
		ОбластьМакета.Области.ОборотнаяСтрокаПараметров.Шрифт = Новый Шрифт(ОбластьМакета,7);
	КонецЕсли;

	Пока Выборка.Следующий() Цикл
		Если ПустаяСтрока(ПунктыПовторно) Тогда
			ПунктыПовторно = Строка(Выборка.Номер);
		Иначе
			ПунктыПовторно = ПунктыПовторно + ", " + Выборка.Номер;
		КонецЕсли;
		ОбластьМакета.Параметры.Заполнить(Выборка);
		ТабДокумент.Вывести(ОбластьМакета);
	КонецЦикла;
	
	//пустые строки (всего не менее 8 строк в таблице)
	Для Сч = (КоличествоСтрок+1) По 8 Цикл
		ОбластьМакета = Макет.ПолучитьОбласть("ОборотнаяСтрокаПараметров");
		ТабДокумент.Вывести(ОбластьМакета);
	КонецЦикла;
	
	ОбластьМакета = Макет.ПолучитьОбласть("ОборотнаяТребованияШапка");
	ТабДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("ОборотнаяТребованияСтрока");
	Выборка = Пакет[3].Выбрать();
	Если Выборка.Количество() > 20 Тогда
		ОбластьМакета.Области.ОборотнаяТребованияСтрока.Шрифт = Новый Шрифт(ОбластьМакета,7);
	КонецЕсли;
	КоличествоСтрок = Выборка.Количество();
	Пока Выборка.Следующий() Цикл
		ОбластьМакета.Параметры.Заполнить(Выборка);
		ТабДокумент.Вывести(ОбластьМакета);
	КонецЦикла;
	//пустые строки (всего не менее 8 строк в таблице)
	Для Сч = (КоличествоСтрок+1) По 8 Цикл
		ОбластьМакета = Макет.ПолучитьОбласть("ОборотнаяТребованияСтрока");
		ТабДокумент.Вывести(ОбластьМакета);
	КонецЦикла;

	ОбластьМакета = Макет.ПолучитьОбласть("ОборотнаяПодвал");
	ОбластьМакета.Параметры.Примечания = Комментарий;
	ОбластьМакета.Параметры.МассаБезНагрузки = МассаБезНагрузки;
	ОбластьМакета.Параметры.ТипТоплива = ТипТоплива;
	ОбластьМакета.Параметры.ТипТормознойСистемы = ТипПриводаТормознойСистемы;
	ОбластьМакета.Параметры.МаркаШин = МаркаШин;
	ОбластьМакета.Параметры.ПунктыДляПовторнойПроверки = ПунктыПовторно;
	ОбластьМакета.Параметры.МаксимальнаяМасса = РазрешеннаяМаксимальнаяМасса;
	ОбластьМакета.Параметры.Пробег = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Автомобиль,Перечисления.ДополнительнаяИнформацияАвтомобилей.Пробег,Дата);
	ОбластьМакета.Параметры.Автор = Автор.Сотрудник;
	
	ОбластьМакета.Параметры.НомерЕАИСТО = Документы.ТехническоеДиагностирование.ПолучитьНомерКартчки(Ссылка);
	
	ДатаСтрокой = Формат(Дата,"ДФ=ddMMyyyy");
	Для Сч = 1 По СтрДлина(ДатаСтрокой) Цикл
		ОбластьМакета.Параметры["Д"+Сч] = Сред(ДатаСтрокой,Сч,1);
	КонецЦикла;
	
	Если ПроверкаПрохожденияТО() Тогда
		ОбластьМакета.Рисунки.Удалить(ОбластьМакета.Рисунки.Возможно);
	Иначе
		ОбластьМакета.Рисунки.Удалить(ОбластьМакета.Рисунки.Невозможно);
	КонецЕсли;
		
	ТабДокумент.Вывести(ОбластьМакета);
	
	Возврат ТабДокумент;
	
КонецФункции

Функция ПечатьДиагностическаяКартаПустая(ТабДокумент) Экспорт
	
	Макет = ПолучитьМакет("ДиагностическаяКарта");
	ОбластьМакета = Макет.ПолучитьОбласть("ЛицеваяСторона");
	
	АттестатТО = спПолучитьПодтверждающийДокументОбъектаПоВиду(ЭтотОбъект.ПодразделениеКомпании,Перечисления.ВидыДокументов.АттестатТО);
	НомерВреестре = "";
	Если (ЗначениеЗаполнено(АттестатТО)) И (ЗначениеЗаполнено(АттестатТО.НомерВРеестреОператоровТО))  Тогда
		НомерВреестре =  " №" + АттестатТО.НомерВРеестреОператоровТО;
	КонецЕсли;
	ОбластьМакета.Параметры.Оператор = ?(ЗначениеЗаполнено(ЭтотОбъект.Организация.КодОператора), ЭтотОбъект.Организация.КодОператора, "") + " " + Строка(ЭтотОбъект.Организация.НаименованиеПолное) + " ("+Строка(ЭтотОбъект.Организация.Наименование)+")"+НомерВреестре;
	ОбластьМакета.Параметры.Пункт = киПолучитьПредставлениеКИ(ЭтотОбъект.ПодразделениеКомпании, Справочники.ВидыКонтактнойИнформации.АдресФактический) + ", " + киПолучитьПредставлениеКИ(ЭтотОбъект.ПодразделениеКомпании, Перечисления.ТипыКонтактнойИнформации.Телефон);
	
	ОбластьМакета.Параметры.Первичная = "";
	ОбластьМакета.Параметры.Повторная = "";
	ОбластьМакета.Параметры.ГосНомер = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер,Дата);
	Если ЗначениеЗаполнено(Автомобиль.Модель) Тогда
		ОбластьМакета.Параметры.Модель = ""+ ?(Автомобиль.Модель.Родитель.Пустая(),"", Строка(Автомобиль.Модель.Родитель) + " " ) + Строка(Автомобиль.Модель);
		КатегорияТС = Автомобиль.Модель.КатегорияТС;
		Если ЗначениеЗаполнено(КатегорияТС) Тогда
			ОбластьМакета.Параметры.КатегорияТС = КатегорияТС.КодПоКлассификатору;	
		КонецЕсли;
	КонецЕсли;
	ОбластьМакета.Параметры.VIN = Автомобиль.VIN;
	ОбластьМакета.Параметры.НомерРамы = Автомобиль.НомерШасси;
	ОбластьМакета.Параметры.НомерКузова = Автомобиль.НомерКузова;
	//ОбластьМакета.Параметры.ПТС = спПолучитьПодтверждающийДокументОбъектаПоВиду(Автомобиль,Перечисления.ВидыДокументов.ПТС);
	ПТС = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.ТехПаспорт);
	Если ЗначениеЗаполнено(ПТС) Тогда
		ОбластьМакета.Параметры.ПТС ="";
		ОбластьМакета.Параметры.ПТС = Строка(ПТС.ВидПодтверждающегоДокумента) + " " + ПТС.Серия + " № "+ ПТС.Номер + " выдан " + ПТС.КемВыдан + " " + Формат(ПТС.ДатаВыдачи,"ДФ='dd MMMM yyyy'") + "г. ";
	КонецЕсли;
	ОбластьМакета.Параметры.ГодВыпуска = Формат(Автомобиль.ГодВыпуска,"ДФ=yyyy");
	ТабДокумент.Вывести(ОбластьМакета);
	ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	
	ОбластьМакета = Макет.ПолучитьОбласть("ОборотнаяШапка");
	ТабДокумент.Вывести(ОбластьМакета);
	
	Для Сч = 1 По 8 Цикл
		ОбластьМакета = Макет.ПолучитьОбласть("ОборотнаяСтрокаПараметров");
		ТабДокумент.Вывести(ОбластьМакета);
	КонецЦикла;
	
	ОбластьМакета = Макет.ПолучитьОбласть("ОборотнаяТребованияШапка");
	ТабДокумент.Вывести(ОбластьМакета);
	
	Для Сч = 1 По 8 Цикл
		ОбластьМакета = Макет.ПолучитьОбласть("ОборотнаяТребованияСтрока");
		ТабДокумент.Вывести(ОбластьМакета);
	КонецЦикла;

	ОбластьМакета = Макет.ПолучитьОбласть("ОборотнаяПодвал");
	ОбластьМакета.Параметры.Примечания = "";
	ОбластьМакета.Параметры.МассаБезНагрузки = "";
	ОбластьМакета.Параметры.ТипТоплива = "";
	ОбластьМакета.Параметры.ТипТормознойСистемы = "";
	ОбластьМакета.Параметры.МаркаШин = "";
	ОбластьМакета.Параметры.ПунктыДляПовторнойПроверки = "";
	ОбластьМакета.Параметры.МаксимальнаяМасса = "";
	ОбластьМакета.Параметры.Пробег = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Автомобиль,Перечисления.ДополнительнаяИнформацияАвтомобилей.Пробег,Дата);
	ОбластьМакета.Параметры.Автор = Автор.Сотрудник;
	
	ДатаСтрокой = Формат(Дата,"ДФ=ddMMyyyy");
	Для Сч = 1 По СтрДлина(ДатаСтрокой) Цикл
		ОбластьМакета.Параметры["Д"+Сч] = Сред(ДатаСтрокой,Сч,1);
	КонецЦикла;
	
	ОбластьМакета.Рисунки.Удалить(ОбластьМакета.Рисунки.Возможно);
	ОбластьМакета.Рисунки.Удалить(ОбластьМакета.Рисунки.Невозможно);
		
	ТабДокумент.Вывести(ОбластьМакета);
	
	Возврат ТабДокумент;
КонецФункции

Функция ПечатьДиагностическаяКартаПовторное(ТабДокумент) Экспорт
	
	Если ЭтотОбъект.Модифицированность() Тогда
		Ответ = Вопрос("Перед печатью документ необходимо записать. Продолжить?",РежимДиалогаВопрос.ДаНет);
		Если Ответ = КодВозвратаДиалога.Да Тогда
			ЭтотОбъект.Записать();
		Иначе
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	Макет = ПолучитьМакет("ДиагностическаяКарта");
	ОбластьМакета = Макет.ПолучитьОбласть("ЛицеваяСторона");
	
	Если ЗначениеЗаполнено(Номер) Тогда
		НомерСтрокой = Строка(Номер);
		Для Сч = 1 По СтрДлина(НомерСтрокой) Цикл
			ОбластьМакета.Параметры["Р"+Сч] = Сред(НомерСтрокой,Сч,1);
		КонецЦикла;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СрокОкончанияДействияТО) Тогда
		ДатаСтрокой = Формат(СрокОкончанияДействияТО,"ДФ=ddMMyyyy");
		Для Сч = 1 По СтрДлина(ДатаСтрокой) Цикл
			ОбластьМакета.Параметры["С"+Сч] = Сред(ДатаСтрокой,Сч,1);
		КонецЦикла;
	КонецЕсли;
	
	АттестатТО = спПолучитьПодтверждающийДокументОбъектаПоВиду(ЭтотОбъект.ПодразделениеКомпании,Перечисления.ВидыДокументов.АттестатТО);
	НомерВреестре = "";
	Если (ЗначениеЗаполнено(АттестатТО)) И (ЗначениеЗаполнено(АттестатТО.НомерВРеестреОператоровТО))  Тогда
		НомерВреестре =  " №" + АттестатТО.НомерВРеестреОператоровТО;
	КонецЕсли;
	ОбластьМакета.Параметры.Оператор = ?(ЗначениеЗаполнено(ЭтотОбъект.Организация.КодОператора), ЭтотОбъект.Организация.КодОператора, "") + " " + Строка(ЭтотОбъект.Организация.НаименованиеПолное) + " ("+Строка(ЭтотОбъект.Организация.Наименование)+")"+НомерВреестре;
	ОбластьМакета.Параметры.Пункт = киПолучитьПредставлениеКИ(ЭтотОбъект.ПодразделениеКомпании, Справочники.ВидыКонтактнойИнформации.АдресФактический) + ", " + киПолучитьПредставлениеКИ(ЭтотОбъект.ПодразделениеКомпании, Перечисления.ТипыКонтактнойИнформации.Телефон);
	
	ОбластьМакета.Параметры.Первичная = "";
	ОбластьМакета.Параметры.Повторная = "x";
	ОбластьМакета.Параметры.ГосНомер = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер,Дата);
	Если ЗначениеЗаполнено(Автомобиль.Модель) Тогда
		ОбластьМакета.Параметры.Модель = ""+ ?(Автомобиль.Модель.Родитель.Пустая(),"", Строка(Автомобиль.Модель.Родитель) + " " ) + Строка(Автомобиль.Модель);
		КатегорияТС = Автомобиль.Модель.КатегорияТС;
		Если ЗначениеЗаполнено(КатегорияТС) Тогда
			ОбластьМакета.Параметры.КатегорияТС = КатегорияТС.КодПоКлассификатору;	
		КонецЕсли;
	КонецЕсли;
	ОбластьМакета.Параметры.VIN = Автомобиль.VIN;
	ОбластьМакета.Параметры.НомерРамы = Автомобиль.НомерШасси;
	ОбластьМакета.Параметры.НомерКузова = Автомобиль.НомерКузова;
	//ОбластьМакета.Параметры.ПТС = спПолучитьПодтверждающийДокументОбъектаПоВиду(Автомобиль,Перечисления.ВидыДокументов.ПТС);
	ПТС = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.ТехПаспорт);
	Если ЗначениеЗаполнено(ПТС) Тогда
		ОбластьМакета.Параметры.ПТС ="";
		ОбластьМакета.Параметры.ПТС = Строка(ПТС.ВидПодтверждающегоДокумента) + " " + ПТС.Серия + " № "+ ПТС.Номер + " выдан " + ПТС.КемВыдан + " " + Формат(ПТС.ДатаВыдачи,"ДФ='dd MMMM yyyy'") + "г. ";
	КонецЕсли;
	Если ЗначениеЗаполнено(МодельТахографа) Или 
		ЗначениеЗаполнено(МаркаТахографа) Или ЗначениеЗаполнено(СерийныйНомерТахографа) Тогда
		ОбластьМакета.Параметры.Тахограф = МаркаТахографа + " " + МодельТахографа + " " + СерийныйНомерТахографа;
	КонецЕсли;
	
	ОбластьМакета.Параметры.ГодВыпуска = Формат(Автомобиль.ГодВыпуска,"ДФ=yyyy");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТехническоеДиагностированиеТребования.Ссылка,
	               |	ТехническоеДиагностированиеТребования.ТребованиеКТранспортномуСредству,
	               |	ТехническоеДиагностированиеТребования.Выполнено,
	               |	ТехническоеДиагностированиеТребования.Значение,
	               |	ТехническоеДиагностированиеТребования.ЗначениеМин,
	               |	ТехническоеДиагностированиеТребования.ЗначениеМакс
	               |ПОМЕСТИТЬ ТЧ
	               |ИЗ
	               |	Документ.ТехническоеДиагностирование.Требования КАК ТехническоеДиагностированиеТребования
	               |ГДЕ
	               |	ТехническоеДиагностированиеТребования.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТребованияКТранспортнымСредствам.Номер,
	               |	ТребованияКТранспортнымСредствам.Ссылка,
	               |	ВЫБОР
	               |		КОГДА ТЧ.Выполнено ЕСТЬ NULL 
	               |			ТОГДА ""-""
	               |		КОГДА ТЧ.Выполнено
	               |			ТОГДА "" ""
	               |		ИНАЧЕ ""х""
	               |	КОНЕЦ КАК Значение
	               |ИЗ
	               |	Справочник.ТребованияКТранспортнымСредствам КАК ТребованияКТранспортнымСредствам
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ТЧ КАК ТЧ
	               |		ПО (ТЧ.ТребованиеКТранспортномуСредству = ТребованияКТранспортнымСредствам.Ссылка)
	               |ГДЕ
	               |	НЕ ТребованияКТранспортнымСредствам.ЭтоГруппа
	               |	И ТребованияКТранспортнымСредствам.Номер МЕЖДУ 0 И 70
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТЧ.ЗначениеМин КАК НГраница,
	               |	ТЧ.ЗначениеМакс КАК ВГраница,
	               |	ТЧ.Значение,
	               |	ВЫРАЗИТЬ(ТЧ.ТребованиеКТранспортномуСредству.НаименованиеПолное КАК СТРОКА(1000)) КАК Требование,
	               |	ТЧ.ТребованиеКТранспортномуСредству.Номер КАК Номер
	               |ИЗ
	               |	ТЧ КАК ТЧ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТребованияКТранспортнымСредствам.ДиапазонЗначений КАК ТребованияКТранспортнымСредствамДиапазонЗначений
	               |		ПО ТЧ.ТребованиеКТранспортномуСредству = ТребованияКТранспортнымСредствамДиапазонЗначений.Ссылка
	               |			И (ТребованияКТранспортнымСредствамДиапазонЗначений.КатегорияТранспортногоСредства = &КатегорияТС)
	               |ГДЕ
	               |	НЕ ТЧ.Выполнено
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Номер
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТЧ.Значение,
	               |	ВЫРАЗИТЬ(ТЧ.ТребованиеКТранспортномуСредству.НаименованиеПолное КАК СТРОКА(1000)) КАК Требование,
	               |	ТЧ.ТребованиеКТранспортномуСредству.Номер КАК Номер,
	               |	ЕСТЬNULL(ТребованияКТранспортнымСредствам.Наименование, """") КАК Деталь
	               |ИЗ
	               |	ТЧ КАК ТЧ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТребованияКТранспортнымСредствам КАК ТребованияКТранспортнымСредствам
	               |		ПО ТЧ.ТребованиеКТранспортномуСредству.Родитель = ТребованияКТранспортнымСредствам.Ссылка
	               |ГДЕ
	               |	НЕ ТЧ.Выполнено
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Номер";
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Запрос.УстановитьПараметр("КатегорияТС",Автомобиль.Модель.КатегорияТС);
	
	Пакет = Запрос.ВыполнитьПакет();
	
	Выборка = Пакет[1].Выбрать();
	Пока Выборка.Следующий() Цикл
		Попытка
			ОбластьМакета.Параметры["Показатель"+Выборка.Номер] = Выборка.Значение;
		Исключение
		КонецПопытки
	КонецЦикла;
	
	ТабДокумент.Вывести(ОбластьМакета);
	ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	
	ОбластьМакета = Макет.ПолучитьОбласть("ОборотнаяШапка");
	ТабДокумент.Вывести(ОбластьМакета);
	
	Выборка = Пакет[2].Выбрать();
	КоличествоСтрок = Выборка.Количество();
	ПунктыПовторно = "";
	Пока Выборка.Следующий() Цикл
		Если ПустаяСтрока(ПунктыПовторно) Тогда
			ПунктыПовторно = Строка(Выборка.Номер);
		Иначе
			ПунктыПовторно = ПунктыПовторно + ", " + Выборка.Номер;
		КонецЕсли;
		ОбластьМакета = Макет.ПолучитьОбласть("ОборотнаяСтрокаПараметров");
		ОбластьМакета.Параметры.Заполнить(Выборка);
		ТабДокумент.Вывести(ОбластьМакета);
	КонецЦикла;
	//пустые строки (всего не менее 8 строк в таблице)
	Для Сч = (КоличествоСтрок+1) По 8 Цикл
		ОбластьМакета = Макет.ПолучитьОбласть("ОборотнаяСтрокаПараметров");
		ТабДокумент.Вывести(ОбластьМакета);
	КонецЦикла;
	
	ОбластьМакета = Макет.ПолучитьОбласть("ОборотнаяТребованияШапка");
	ТабДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("ОборотнаяТребованияСтрока");
	Выборка = Пакет[3].Выбрать();
	КоличествоСтрок = Выборка.Количество();
	Пока Выборка.Следующий() Цикл
		ОбластьМакета.Параметры.Заполнить(Выборка);
		ТабДокумент.Вывести(ОбластьМакета);
	КонецЦикла;
	//пустые строки (всего не менее 8 строк в таблице)
	Для Сч = (КоличествоСтрок+1) По 8 Цикл
		ОбластьМакета = Макет.ПолучитьОбласть("ОборотнаяТребованияСтрока");
		ТабДокумент.Вывести(ОбластьМакета);
	КонецЦикла;

	ОбластьМакета = Макет.ПолучитьОбласть("ОборотнаяПодвал");
	ОбластьМакета.Параметры.Примечания = Комментарий;
	ОбластьМакета.Параметры.МассаБезНагрузки = МассаБезНагрузки;
	ОбластьМакета.Параметры.ТипТоплива = ТипТоплива;
	ОбластьМакета.Параметры.ТипТормознойСистемы = ТипПриводаТормознойСистемы;
	ОбластьМакета.Параметры.МаркаШин = МаркаШин;
	ОбластьМакета.Параметры.ПунктыДляПовторнойПроверки = ПунктыПовторно;
	ОбластьМакета.Параметры.МаксимальнаяМасса = РазрешеннаяМаксимальнаяМасса;
	ОбластьМакета.Параметры.Пробег = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Автомобиль,Перечисления.ДополнительнаяИнформацияАвтомобилей.Пробег,Дата);
	ОбластьМакета.Параметры.Автор = Автор.Сотрудник;
	
	ОбластьМакета.Параметры.НомерЕАИСТО = Документы.ТехническоеДиагностирование.ПолучитьНомерКартчки(Ссылка);
	
	ДатаСтрокой = Формат(Дата,"ДФ=ddMMyyyy");
	Для Сч = 1 По СтрДлина(ДатаСтрокой) Цикл
		ОбластьМакета.Параметры["Д"+Сч] = Сред(ДатаСтрокой,Сч,1);
	КонецЦикла;
	
	Если ПроверкаПрохожденияТО() Тогда
		ОбластьМакета.Рисунки.Удалить(ОбластьМакета.Рисунки.Возможно);
	Иначе
		ОбластьМакета.Рисунки.Удалить(ОбластьМакета.Рисунки.Невозможно);
	КонецЕсли;
	
	ТабДокумент.Вывести(ОбластьМакета);
	
	Возврат ТабДокумент;
	
КонецФункции

Процедура ПолучитьТаблицуТребований(ЗапросПоТребованиям,СсылкаНаДокумент)
	
	ЗапросПоТребованиям.Текст = "ВЫБРАТЬ
	|	ТехническоеДиагностированиеТребования.Ссылка,
	|	ТехническоеДиагностированиеТребования.ТребованиеКТранспортномуСредству,
	|	ТехническоеДиагностированиеТребования.Выполнено,
	|	ТехническоеДиагностированиеТребования.Значение
	|ПОМЕСТИТЬ ТЧОснование
	|ИЗ
	|	Документ.ТехническоеДиагностирование.Требования КАК ТехническоеДиагностированиеТребования
	|ГДЕ
	|	ТехническоеДиагностированиеТребования.Ссылка = &Ссылка
	|	И НЕ ТехническоеДиагностированиеТребования.ТребованиеКТранспортномуСредству В
	|				(ВЫБРАТЬ
	|					ТЧ.ТребованиеКТранспортномуСредству
	|				ИЗ
	|					ТЧ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЧ.Выполнено,
	|	ТЧ.Ссылка,
	|	ТЧ.ТребованиеКТранспортномуСредству,
	|	ТЧ.Значение
	|ПОМЕСТИТЬ ВремТЧ
	|ИЗ
	|	ТЧ КАК ТЧ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТЧОснование.Выполнено,
	|	ТЧОснование.Ссылка,
	|	ТЧОснование.ТребованиеКТранспортномуСредству,
	|	ТЧОснование.Значение
	|ИЗ
	|	ТЧОснование КАК ТЧОснование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТЧ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВремТЧ.Выполнено,
	|	ВремТЧ.Ссылка,
	|	ВремТЧ.ТребованиеКТранспортномуСредству,
	|	ВремТЧ.Значение
	|ПОМЕСТИТЬ ТЧ
	|ИЗ
	|	ВремТЧ КАК ВремТЧ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТЧОснование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВремТЧ";
	
	ЗапросПоТребованиям.УстановитьПараметр("Ссылка",СсылкаНаДокумент);
	ЗапросПоТребованиям.Выполнить();
	
	Если ТипЗнч(СсылкаНаДокумент.ДокументОснование) = Тип("ДокументСсылка.ТехническоеДиагностирование") Тогда
		ПолучитьТаблицуТребований(ЗапросПоТребованиям,СсылкаНаДокумент.ДокументОснование);
	КонецЕсли;
КонецПроцедуры

// Функция осуществляет печать произвольного документа.
	// Можно направить печать на экран или принтер, а также распечатать необходимое количество копий.
	//
	// Параметры:
	//	ЭтотОбъект							- ДокументОбъект	- Документ для печати
	//	НазваниеПечатнойФормы 				- Строка			- Название печатной формы, если пусто, то по умолчанию
	//	КоличествоЭкземпляров				- Число				- Количество экземпляров документа
	//	НаПринтер							- Булево			- Признак отправки документа на принтер без отображения его на экране
	//  Документ 	  						- ТабличныйДокумент	- Макет печатной формы
	//
	// Возвращаемое значение:
	//   ТабличныйДокумент	- Сформированная печатная форма
	//
Функция Печать(НазваниеПечатнойФормы="", КоличествоЭкземпляров=0, НаПринтер=Ложь, Документ=Неопределено) Экспорт
	Возврат дкПечать(ЭтотОбъект, НазваниеПечатнойФормы, КоличествоЭкземпляров, НаПринтер, Документ);
КонецФункции // Печать()

#КонецЕсли
// Если Клиент Тогда - завершена клиентская часть

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	Если НЕ дкПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс) Тогда Возврат; КонецЕсли;
КонецПроцедуры // ПриУстановкеНовогоНомера()

// Процедура - обработчик ввода на основании
Процедура ОбработкаЗаполнения(Основание)
	Рез=дкОбработкаЗаполнения(ЭтотОбъект, Основание,,);
	
	Если НЕ Рез Тогда Возврат; КонецЕсли;
	
	#Если Клиент Тогда
	зфТехническоеДиагностированиеОбработкаЗаполнения(ЭтотОбъект);
	#ИначеЕсли Сервер Тогда
	зфЗащищенныеФункцииСервер.ТехническоеДиагностированиеОбработкаЗаполнения(ЭтотОбъект);
	#КонецЕсли
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ДоговорПроведенияТехническогоОсмотра") Тогда
		ОбработкаРеквизита("Автомобиль");
	КонецЕсли;
	
	Если ДокументОснование <> Неопределено Тогда
		Если ТипЗнч(ДокументОснование) = Тип("Структура") Тогда
			КатегорияТС = ДокументОснование.КатегорияТС1;
		Иначе
			Если ТипЗнч(ДокументОснование.Автомобиль) = Тип("Строка") Тогда
				КатегорияТС = ДокументОснование.КатегорияТС;
			Иначе
				КатегорияТС = ДокументОснование.Автомобиль.Модель.КатегорияТС;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры // ОбработкаЗаполнения()

Процедура ПриКопировании(ОбъектКопирования)
	Если НЕ дкПриКопировании(ЭтотОбъект, ОбъектКопирования) Тогда Возврат; КонецЕсли;
КонецПроцедуры // ПриКопировании()

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)	
	Если НЕ дкПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда Возврат; КонецЕсли;	
КонецПроцедуры // ПередЗаписью()

Процедура ПриЗаписи(Отказ)
	Если НЕ дкПриЗаписи(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
КонецПроцедуры // ПриЗаписи()

Процедура ПередУдалением(Отказ)
	Если НЕ дкПередУдалением(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
КонецПроцедуры // ПередУдалением()

Процедура ОбработкаУдаленияПроведения(Отказ)
	Если НЕ дкОбработкаУдаленияПроведения(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
	
	// удалим его из регистра отправки	
	НаборЗаписейРегистра = РегистрыСведений.ЖурналОтправкиВЕАИСТО.СоздатьНаборЗаписей();
	
	// установим отборы по документу
	ОтборДок = НаборЗаписейРегистра.Отбор.Найти("Документ");
	Если ОтборДок = Неопределено Тогда
		ОтборДок = НаборЗаписейРегистра.Отбор.Добавить("Документ","Документ");
	КонецЕсли;
	
	ОтборДок.ВидСравнения  = ВидСравнения.Равно;
	ОтборДок.Значение      = Ссылка;
	ОтборДок.Использование = Истина;
	
	НаборЗаписейРегистра.Прочитать();
	Если НаборЗаписейРегистра.Количество() > 0 Тогда
		ВсеОК = Истина;
		Для Каждого ЗаписьРег Из НаборЗаписейРегистра Цикл
			Если ЗаписьРег.Статус = Перечисления.СтатусыДокументаТО.Отправлено Тогда
				ВсеОК = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если ВсеОК Тогда
			НаборЗаписейРегистра.Очистить();
			Попытка
				НаборЗаписейРегистра.Записать();
			Исключение
				Отказ = Истина;
				Сообщить("При удалении движений обнаружены ощибки." + Символы.ПС + "Не удалось удалить данные об отправке по причине: " + Символы.ПС + ОписаниеОшибки() + ".");
			КонецПопытки;
		Иначе
			Отказ = Истина;
			Сообщить("Для документов отправленных в ЕАИС ТО запрещена отмена проведения.");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры // ОбработкаУдаленияПроведения()

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если ХозОперация <> Справочники.ХозОперации.ТехническоеДиагностированиеДубликат Тогда
		Если НЕ дкОбработкаПроведения(ЭтотОбъект, Отказ, Режим) Тогда Возврат; КонецЕсли;
		
		зфЗащищенныеФункцииСервер.ЗафиксироватьРезультатыТехническогоДиагностирования(Ссылка);
		
		// определим необходимость формирования корректирующих проводок
		дкВыводРезультатовОбработки(ЭтотОбъект,Отказ);	
	КонецЕсли;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

// сохранение ссылки на коллекцию прав, настроек и окружения
Права = Неопределено;
#Если Клиент Тогда
Права = глПрава;
#КонецЕсли
